read_file -format verilog dec_2_2.v
link
compile_ultra
report_area > dec_2_2.area_rpt
report_power > dec_2_2.power_rpt

read_file -format verilog dec_2_7.v
link
compile_ultra
report_area > dec_2_7.area_rpt
report_power > dec_2_7.power_rpt

read_file -format verilog dec_3_2.v
link
compile_ultra
report_area > dec_3_2.area_rpt
report_power > dec_3_2.power_rpt

read_file -format verilog dec_3_6.v
link
compile_ultra
report_area > dec_3_6.area_rpt
report_power > dec_3_6.power_rpt

read_file -format verilog dec_4_2.v
link
compile_ultra
report_area > dec_4_2.area_rpt
report_power > dec_4_2.power_rpt

read_file -format verilog dec_4_5.v
link
compile_ultra
report_area > dec_4_5.area_rpt
report_power > dec_4_5.power_rpt

read_file -format verilog dec_5_2.v
link
compile_ultra
report_area > dec_5_2.area_rpt
report_power > dec_5_2.power_rpt

read_file -format verilog dec_5_4.v
link
compile_ultra
report_area > dec_5_4.area_rpt
report_power > dec_5_4.power_rpt

read_file -format verilog dec_6_2.v
link
compile_ultra
report_area > dec_6_2.area_rpt
report_power > dec_6_2.power_rpt

read_file -format verilog dec_6_3.v
link
compile_ultra
report_area > dec_6_3.area_rpt
report_power > dec_6_3.power_rpt

read_file -format verilog dec_7_2.v
link
compile_ultra
report_area > dec_7_2.area_rpt
report_power > dec_7_2.power_rpt

read_file -format verilog dec_8_1.v
link
compile_ultra
report_area > dec_8_1.area_rpt
report_power > dec_8_1.power_rpt