read_file -format verilog CACdec_4.v
link
compile_ultra
report_area > CACdec_4.area_rpt
report_power > CACdec_4.power_rpt

read_file -format verilog CACdec_5.v
link
compile_ultra
report_area > CACdec_5.area_rpt
report_power > CACdec_5.power_rpt

read_file -format verilog CACdec_6.v
link
compile_ultra
report_area > CACdec_6.area_rpt
report_power > CACdec_6.power_rpt

read_file -format verilog CACdec_7.v
link
compile_ultra
report_area > CACdec_7.area_rpt
report_power > CACdec_7.power_rpt

read_file -format verilog CACdec_8.v
link
compile_ultra
report_area > CACdec_8.area_rpt
report_power > CACdec_8.power_rpt

read_file -format verilog CACdec_9.v
link
compile_ultra
report_area > CACdec_9.area_rpt
report_power > CACdec_9.power_rpt