read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_2_2.v
set_design_top FNSadders_2_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_2_2.area_rpt
report_power > FNSadders_2_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_2_7.v
set_design_top FNSadders_2_7
set_max_area 0
link
compile_ultra
report_area > FNSadders_2_7.area_rpt
report_power > FNSadders_2_7.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_3_2.v
set_design_top FNSadders_3_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_3_2.area_rpt
report_power > FNSadders_3_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_3_6.v
set_design_top FNSadders_3_6
set_max_area 0
link
compile_ultra
report_area > FNSadders_3_6.area_rpt
report_power > FNSadders_3_6.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_4_2.v
set_design_top FNSadders_4_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_4_2.area_rpt
report_power > FNSadders_4_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_4_5.v
set_design_top FNSadders_4_5
set_max_area 0
link
compile_ultra
report_area > FNSadders_4_5.area_rpt
report_power > FNSadders_4_5.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_5_2.v
set_design_top FNSadders_5_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_5_2.area_rpt
report_power > FNSadders_5_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_5_4.v
set_design_top FNSadders_5_4
set_max_area 0
link
compile_ultra
report_area > FNSadders_5_4.area_rpt
report_power > FNSadders_5_4.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_6_2.v
set_design_top FNSadders_6_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_6_2.area_rpt
report_power > FNSadders_6_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_6_3.v
set_design_top FNSadders_6_3
set_max_area 0
link
compile_ultra
report_area > FNSadders_6_3.area_rpt
report_power > FNSadders_6_3.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_7_2.v
set_design_top FNSadders_7_2
set_max_area 0
link
compile_ultra
report_area > FNSadders_7_2.area_rpt
report_power > FNSadders_7_2.power_rpt
remove_design -designs

read_file -format verilog {adder_f02.v adder_f03.v adder_f04.v adder_f05.v adder_f06.v adder_f07.v adder_f08.v adder_f09.v adder_f10.v full_adder.v half_adder.v}
read_file -format verilog FNSadders_8_1.v
set_design_top FNSadders_8_1
set_max_area 0
link
compile_ultra
report_area > FNSadders_8_1.area_rpt
report_power > FNSadders_8_1.power_rpt
remove_design -designs


