%plot
close all;

x1 = 1:2:19;

R1_27 = [1.0000,    1.0000,    0.9968,    0.9797,    0.9347,    0.8488,    0.7163,    0.5451,    0.3598,    0.1951];
R1_27a = [1.0000,    0.9256,    0.7657,    0.5585,    0.3536,    0.1905,    0.0852,    0.0306,    0.0085,    0.0017];
R1_27b = [1.0000,    0.9971,    0.9723,    0.9091,    0.7990,    0.6464,    0.4699,    0.2981,    0.1591,    0.0680];

R1_36 = [1.0000,    1.0000,    1.0000,    0.9992,    0.9954,    0.9845,    0.9608,    0.9175,    0.8481,    0.7484];
R1_36a = [1.0000,    0.9502,    0.8396,    0.6857,    0.5138,    0.3504,    0.2153,    0.1179,    0.0567,    0.0235];
R1_36b = [1.0000,    0.9985,    0.9857,    0.9518,    0.8897,    0.7963,    0.6745,    0.5338,    0.3887,    0.2559];

x2 = 1:1:6;

R2_6 = [1.0000,    1.0000,    1.0000,    0.9301,    0.7343,    0.4079];
R2_6a = [1.0000,    0.8901,    0.6813,    0.4236,    0.1918,    0.0480];
R2_6b = [1.0000,    1.0000,    0.9341,    0.7692,    0.4995,    0.1998];

figure(1);
plot(x1,R1_27,'-k.',x1,R1_27a,'--k.',x1,R1_27b,'-.k.',x1,R1_36,'-k.',x1,R1_36a,'--k.',x1,R1_36b,'-.k.');
axis([1,19,0,1])
%legend('本方案，27个冗余TSV','多路选择器方案，27个冗余TSV','信号开关方案和扩展的多路选择器方案，27个冗余TSV','本方案，36个冗余TSV','多路选择器方案，36个冗余TSV','信号开关方案和扩展的多路选择器方案，36个冗余TSV');
xlabel('Number of faulty TSVs')  %x轴坐标描述
ylabel('Reparability') %y轴坐标描述
set(gca,'XTick',[1:2:19]) 
set(gca,'YTick',[0:0.2:1]) 

figure(2);
plot(x2,R2_6,'-k.',x2,R2_6a,'--k.',x2,R2_6b,'-.k.');
axis([1,6,0,1])
%legend('本方案，27个冗余TSV','多路选择器方案，27个冗余TSV','信号开关方案和扩展的多路选择器方案，27个冗余TSV','本方案，36个冗余TSV','多路选择器方案，36个冗余TSV','信号开关方案和扩展的多路选择器方案，36个冗余TSV');
xlabel('Number of faulty TSVs')  %x轴坐标描述
ylabel('Reparability') %y轴坐标描述
set(gca,'XTick',[1:1:6]) 
set(gca,'YTick',[0:0.2:1])


figure(3);
plot(x1,R1_36,'-k.',x1,R1_36a,'--k.',x1,R1_36b,'-.k.');
axis([1,19,0,1])
legend('本方案','多路选择器方案','信号开关方案和扩展的多路选择器方案');
xlabel('失效TSV数目')  %x轴坐标描述
ylabel('修复率') %y轴坐标描述
set(gca,'XTick',[1:2:19]) 
set(gca,'YTick',[0:0.2:1])